docs/now.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>What I'm doing now</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet"href="resources/org.css"type="text/css" /><header><a href="index.html">Home</a>&emsp;<a href="about.html">About Me</a>&emsp;<a href="https://github.com/abdrysdale/abdrysdale.github.io">Source</a>&emsp;<a href="sitemap.html">Sitemap</a>&emsp;<a href="feed.xml">RSS</a></header>
</head>
<body>
<div id="content" class="content">
<h1 class="title">What I'm doing now</h1>
<p>
This is a <a href="https://sive.rs/now">now</a> page.
</p>

<p>
Here's what I'm working on now:
</p>

<ul class="org-ul">
<li>Twiddling my fingers whilst I wait for my PhD viva.</li>
<li>I've been reading a lot - <i>I'm on track to read over 100 books this year with a few this year being over 1000 pages.</i></li>
<li>Reading through the entirety of Python's standard library.</li>
<li>But most importantly, spending time with my family.</li>
</ul>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-04-24 Thu 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
</div>
</body>
</html>
